[
  {
    "id": "auth_register_overview",
    "keywords": ["регистрация", "новый аккаунт", "создать профиль", "пройти регистрацию", "signup", "начать пользоваться", "регистрация в приложении"],
    "answer": "Регистрация проходит поэтапно и занимает пару минут. Нажмите «Зарегистрироваться» на экране входа, укажите почту и номер телефона, затем подтвердите контакты кодами из письма и SMS. После этого останется заполнить личные данные и придумать пароль, и профиль будет готов.",
    "deeplink": "vseuslugi://auth/register"
  },
  {
    "id": "auth_register_email_verification",
    "keywords": ["код подтверждения", "верификация email", "код из письма", "не приходит код", "повторная отправка", "подтвердить почту"],
    "answer": "После ввода почты отправляем письмо с 4-значным кодом. Откройте почтовый ящик, перепишите код в поле подтверждения и нажмите «Готово». Нет письма в течение минуты — проверьте папку Спам и нажмите «Отправить снова». Активный код действует 10 минут.",
    "deeplink": "vseuslugi://auth/register/code"
  },
  {
    "id": "auth_register_profile_data",
    "keywords": ["анкета профиля", "ФИО", "паспортные данные", "телефон при регистрации", "личные данные", "редактирование анкеты"],
    "answer": "На шаге анкеты укажите имя, фамилию, отчество (по желанию) и рабочий номер телефона. Эти данные видят ваши заказчики, поэтому проверяйте орфографию. Если ошиблись, можно сразу вернуться назад и поправить сведения до завершения регистрации.",
    "deeplink": "vseuslugi://auth/register/profile"
  },
  {
    "id": "auth_register_create_password",
    "keywords": ["придумать пароль", "пароль при регистрации", "правила пароля", "подтверждение пароля", "безопасный пароль"],
    "answer": "Пароль должен быть не короче 6 символов и содержать цифры или буквы. Введите пароль дважды, чтобы исключить опечатки. Сохраняйте его в надежном месте и не передавайте третьим лицам, чтобы защищать аккаунт от взлома.",
    "deeplink": "vseuslugi://auth/register/password"
  },
  {
    "id": "auth_login",
    "keywords": ["войти", "авторизация", "логин", "sign in", "доступ к аккаунту", "телефон и пароль", "повторный вход"],
    "answer": "На экране входа укажите номер телефона и пароль, затем нажмите «Войти». Если используете чужое устройство, не забывайте выходить после завершения работы. При неверном пароле появится подсказка о сбросе — этим стоит воспользоваться, чтобы не заблокировать профиль.",
    "deeplink": "vseuslugi://auth/login"
  },
  {
    "id": "auth_forgot_password",
    "keywords": ["забыли пароль", "восстановление доступа", "reset password", "сброс пароля", "проблема со входом"],
    "answer": "Нажмите «Забыли пароль?» на экране входа, укажите почту и получите код подтверждения. После ввода кода задайте новый пароль. Сразу после смены пароля можно входить в приложение, а старый пароль перестанет работать.",
    "deeplink": "vseuslugi://auth/password/reset"
  },
  {
    "id": "auth_reset_verification",
    "keywords": ["код восстановления", "не приходит код восстановления", "подтверждение сброса", "код для смены пароля"],
    "answer": "Код восстановления отправляем на указанную почту. Он состоит из четырех цифр и действует ограниченное время. Если письмо не пришло, проверьте правильность почты и запросите отправку повторно. После ввода кода откроется экран создания нового пароля.",
    "deeplink": "vseuslugi://auth/password/reset/code"
  },
  {
    "id": "auth_reset_new_password",
    "keywords": ["установить новый пароль", "изменить пароль", "новый пароль после сброса", "повторение пароля"],
    "answer": "Введите новый пароль дважды, соблюдая минимальную длину 6 символов. Система принимает только уникальные комбинации, поэтому не используйте предыдущий пароль. После сохранения сразу появится кнопка «Войти» для быстрого доступа в учетную запись.",
    "deeplink": "vseuslugi://auth/password/reset/new"
  },
  {
    "id": "auth_logout",
    "keywords": ["выйти из аккаунта", "разлогиниться", "сменить пользователя", "logout", "выйти из профиля"],
    "answer": "Чтобы выйти, откройте раздел «Профиль», пролистайте вниз и нажмите «Выход». Подтвердите действие, если пользуетесь общим устройством. После выхода push-уведомления перестанут приходить до следующего входа.",
    "deeplink": "vseuslugi://profile/logout"
  },
  {
    "id": "security_account_protection",
    "keywords": ["безопасность аккаунта", "защита профиля", "подозрительная активность", "двухфакторная защита", "советы безопасности"],
    "answer": "Мы защищаем учетные записи шифрованием и мгновенным выходом при смене пароля. От себя: используйте уникальный пароль, выключайте автоматическое сохранение на чужих устройствах и не сообщайте коды подтверждения третьим лицам. Увидели подозрительный вход — срочно смените пароль и напишите в поддержку.",
    "deeplink": ""
  },
  {
    "id": "security_data_privacy",
    "keywords": ["конфиденциальность", "персональные данные", "privacy", "кто видит мои данные", "хранение данных"],
    "answer": "Мы используем данные только для работы приложения и не передаем их без вашего согласия. Заказчики видят лишь имя, фото, рейтинг и контакт для связи. Документы, загруженные для модерации, доступны только проверяющим специалистам и хранятся в зашифрованном виде.",
    "deeplink": "vseuslugi://profile/privacy"
  },
  {
    "id": "profile_edit",
    "keywords": ["редактирование профиля", "изменить имя", "сменить телефон", "обновить профиль", "профиль пользователя"],
    "answer": "Перейдите в «Профиль» → «Мой профиль». Здесь можно обновить имя, фамилию, отчество, телефон, дату рождения и описание о себе. После внесения изменений нажмите «Сохранить», чтобы данные сразу обновились в объявлениях и заказах.",
    "deeplink": "vseuslugi://profile/edit"
  },
  {
    "id": "profile_change_password",
    "keywords": ["сменить пароль", "обновить пароль", "пароль в настройках", "безопасность профиля"],
    "answer": "Откройте «Профиль» → «Настройки» → «Изменить пароль». Введите текущий пароль для подтверждения личности, затем новый пароль и его повтор. После сохранения система автоматически выходит из аккаунта на других устройствах.",
    "deeplink": "vseuslugi://profile/settings/password"
  },
  {
    "id": "profile_change_avatar",
    "keywords": ["фото профиля", "аватар", "добавить фотографию", "заменить аватар", "селфи"],
    "answer": "В разделе «Мой профиль» нажмите на фото или иконку камеры. Выберите снимок из галереи или сделайте новый. Поддерживаем квадратные изображения до 10 МБ. После загрузки картинка автоматически обрежется под круглый формат.",
    "deeplink": "vseuslugi://profile/edit/avatar"
  },
  {
    "id": "profile_language",
    "keywords": ["язык интерфейса", "русский казахский", "сменить язык", "двуязычный интерфейс"],
    "answer": "Перейдите в «Профиль» → «Настройки» → «Язык». Выберите русский или казахский интерфейс, изменения применяются моментально и не требуют перезапуска приложения.",
    "deeplink": "vseuslugi://settings/language"
  },
  {
    "id": "profile_notifications",
    "keywords": ["уведомления", "push", "звуковые уведомления", "уведомления заказов", "настроить уведомления"],
    "answer": "В «Настройках» откройте пункт «Уведомления» и отметьте события, о которых хотите получать сигналы: новые сообщения, заказы, отзывы, новости сервиса. Если push не приходят, проверьте разрешения в системных настройках телефона.",
    "deeplink": "vseuslugi://settings/notifications"
  },
  {
    "id": "profile_delete",
    "keywords": ["удалить аккаунт", "деактивировать профиль", "закрыть учетную запись", "удаление данных"],
    "answer": "В разделе «Настройки» нажмите «Удалить аккаунт». После подтверждения профиль, объявления, заказы и история платежей будут удалены без возможности восстановления. Перед удалением обязательно выведите средства из кошелька.",
    "deeplink": "vseuslugi://settings/delete-account"
  },
  {
    "id": "profile_help_center",
    "keywords": ["поддержка", "центр справки", "FAQ", "контакты помощи", "написать в поддержку"],
    "answer": "В разделе «Профиль» откройте «Помощь». Здесь собраны популярные ответы, форма обращения и ссылки на социальные сети. Опишите проблему, добавьте скриншоты и оставьте контакт, чтобы мы ответили быстрее.",
    "deeplink": "vseuslugi://profile/help"
  },
  {
    "id": "profile_privacy_policy",
    "keywords": ["политика конфиденциальности", "условия использования", "публичная оферта", "legal"],
    "answer": "Документы находятся в «Профиль» → «Пользовательское соглашение». В тексте описаны права пользователей, порядок хранения данных и правила размещения объявлений. Рекомендуем ознакомиться перед публикацией контента.",
    "deeplink": "vseuslugi://profile/privacy"
  },
  {
    "id": "wallet_overview",
    "keywords": ["кошелек", "баланс", "внутренний счет", "оплата услуг", "кошелёк приложения"],
    "answer": "Кошелек — это ваш внутренний счет для оплат, откликов и получения средств за выполненные заказы. Баланс отображается в разделе «История платежей» и обновляется мгновенно после каждой операции. Деньги в кошельке можно пополнять и выводить на карту.",
    "deeplink": "vseuslugi://profile/payments"
  },
  {
    "id": "wallet_top_up",
    "keywords": ["пополнить баланс", "пополнение кошелька", "внести деньги", "баланс для откликов"],
    "answer": "Откройте «Профиль» → «История платежей» → «Пополнить». Выберите сумму и способ оплаты (карта или мобильные платежи) и подтвердите операцию. Чек приходит на почту, а средства сразу отображаются в кошельке.",
    "deeplink": "vseuslugi://profile/payments"
  },
  {
    "id": "wallet_withdraw",
    "keywords": ["вывести деньги", "перевод на карту", "получить средства", "вывод заработка"],
    "answer": "Заработанные средства можно вывести с баланса на банковскую карту. В разделе «История платежей» нажмите «Вывести», укажите сумму и реквизиты. Перевод занимает до 2 рабочих дней, статус запроса видно в той же ленте.",
    "deeplink": ""
  },
  {
    "id": "payment_methods",
    "keywords": ["способы оплаты", "добавить карту", "Apple Pay", "Google Pay", "чем платить"],
    "answer": "Мы принимаем банковские карты, Apple Pay, Google Pay и корпоративные промокоды. При первой оплате карта сохраняется в зашифрованном виде и доступна только вам. В любой момент карту можно удалить в разделе платежей.",
    "deeplink": ""
  },
  {
    "id": "ad_create",
    "keywords": ["создать объявление", "добавить объявление", "публикация услуги", "новое объявление", "объявление услуги"],
    "answer": "На главном экране нажмите «Создать объявление». Шаги: 1) выберите направление (Услуги, Работа, Прокат); 2) задайте категорию и город; 3) впишите понятное название, подробное описание, стоимость и контакты; 4) загрузите минимум одно фото. После подтверждения объявление уйдет на модерацию и станет видимым клиентам.",
    "deeplink": "vseuslugi://ad/create"
  },
  {
    "id": "ad_create_category",
    "keywords": ["выбрать категорию", "категории услуг", "тип объявления", "подбор категории"],
    "answer": "Категория показывает пользователям, где искать ваше предложение. Сначала отмечаете крупный раздел (Услуги, Работа или Прокат), затем конкретное направление. Если сомневаетесь, прочитайте короткие описания в списке — так проще выбрать подходящий вариант и быстрее пройти модерацию.",
    "deeplink": "vseuslugi://ad/create/category"
  },
  {
    "id": "ad_edit",
    "keywords": ["редактировать объявление", "обновить цену", "изменить описание", "исправить ошибку", "изменить фото"],
    "answer": "Откройте «Профиль» → «Мои объявления», выберите нужное и нажмите «Редактировать». После изменения названия, текста, цены или фотографий сохраните карточку и дождитесь повторной проверки. Обновления применяются после модерации.",
    "deeplink": "vseuslugi://ad/edit"
  },
  {
    "id": "ad_pause_or_delete",
    "keywords": ["приостановить объявление", "удалить объявление", "снять с публикации", "архив объявления"],
    "answer": "В «Моих объявлениях» можно временно скрыть карточку кнопкой «Снять с публикации» или удалить полностью. При удалении теряется статистика просмотров; при паузе объявление остается в черновиках и его можно снова включить в любой момент.",
    "deeplink": "vseuslugi://ad/delete"
  },
  {
    "id": "ad_moderation",
    "keywords": ["модерация", "проверка объявления", "отклонено модерацией", "правила публикации"],
    "answer": "Каждое объявление проверяется до 15 минут. Модераторы смотрят, чтобы текст был понятным, без запрещенных услуг, контакты располагались в специальных полях, а фото соответствовали описанию. Если объявление отклонено, в уведомлении укажем причину и как исправить.",
    "deeplink": ""
  },
  {
    "id": "ad_highlight",
    "keywords": ["поднять объявление", "выделить объявление", "платное продвижение", "больше показов"],
    "answer": "Используйте платные опции в карточке объявления: поднятие в списке, закрепление на главной или продвижение в ленте. Выберите услугу, оплатите ее из кошелька, и объявление получит больше показов на нужный период.",
    "deeplink": ""
  },
  {
    "id": "ad_add_favorite",
    "keywords": ["добавить в избранное", "сохранить объявление", "любимое объявление", "сердечко"],
    "answer": "Нажмите на иконку сердца в карточке объявления или профиле специалиста. Сохраненные позиции появляются в разделе «Профиль» → «Избранное», откуда можно вернуться к ним в любое время и оформить заказ.",
    "deeplink": ""
  },
  {
    "id": "ad_report",
    "keywords": ["пожаловаться", "нарушение", "репорт объявления", "жалоба модераторам", "некорректное объявление"],
    "answer": "В карточке объявления нажмите на три точки и выберите «Пожаловаться». Коротко опишите проблему, приложите скриншоты или фото. Модераторы рассмотрят обращение и при необходимости удалят объявление, уведомив автора.",
    "deeplink": ""
  },
  {
    "id": "ad_reviews",
    "keywords": ["посмотреть отзывы", "рейтинг", "оценки исполнителя", "мнения клиентов"],
    "answer": "Пролистайте карточку объявления до блока «Отзывы». Там видны оценки по пятибалльной шкале и комментарии клиентов. Нажмите «Все отзывы», чтобы открыть полный список и понять, как исполнитель выполняет заказы.",
    "deeplink": ""
  },
  {
    "id": "search_categories",
    "keywords": ["поиск услуги", "категории", "найти специалиста", "поиск работы", "поиск проката"],
    "answer": "Во вкладке «Поиск» выберите тип (Услуги, Работа, Прокат), отметьте категорию и город. Используйте строку поиска для ключевых слов вроде «электрик» или «аренда авто», чтобы получить точные результаты.",
    "deeplink": "vseuslugi://search"
  },
  {
    "id": "search_filters",
    "keywords": ["фильтры", "сортировка", "цена", "рейтинг", "расстояние", "настроить поиск"],
    "answer": "Нажмите «Фильтры» и задайте бюджет, рейтинг исполнителя, тип оплаты, время отклика или расстояние. Можно сохранять набор фильтров и возвращаться к нему позже, чтобы быстрее находить нужные предложения.",
    "deeplink": "vseuslugi://search/filter"
  },
  {
    "id": "map_view",
    "keywords": ["карта заказов", "геолокация", "заказы поблизости", "карта города"],
    "answer": "Вкладка «Карта» показывает активные заказы и объявления на карте города. Приближайте и перемещайте карту, чтобы увидеть детали, нажимайте на маркеры для открытия карточки и быстрого отклика.",
    "deeplink": "vseuslugi://map"
  },
  {
    "id": "map_go_online",
    "keywords": ["выйти на линию", "принимать заказы", "режим работы", "онлайн статус", "доступность исполнителя"],
    "answer": "На карте включите переключатель «На линии». Пока он активен, вы отображаетесь заказчикам и получаете новые заказы. Завершили смену — выключите переключатель, чтобы не получать запросы.",
    "deeplink": "vseuslugi://map/online"
  },
  {
    "id": "map_select_area",
    "keywords": ["область поиска", "зона работы", "нарисовать область", "ограничить поиск"],
    "answer": "Нажмите «Выбрать область» и обведите пальцем нужный район. После сохранения отображаются только объявления внутри этой зоны. Функция удобна, если принимаете заказы в конкретном квартале или районе.",
    "deeplink": "vseuslugi://map/area/select"
  },
  {
    "id": "chat_overview",
    "keywords": ["чаты", "сообщения", "переписка", "диалог с клиентом", "чат со специалистом"],
    "answer": "Во вкладке «Чаты» собраны все переписки с заказчиками и исполнителями. Уведомления о новых сообщениях приходят push-уведомлением. Можно закреплять важные диалоги и быстро переходить к ним с главного экрана.",
    "deeplink": "vseuslugi://chats"
  },
  {
    "id": "chat_send_files",
    "keywords": ["отправить фото", "документы в чат", "прикрепить файл", "отправить видео"],
    "answer": "В диалоге нажмите на скрепку или иконку камеры, чтобы прикрепить изображения, документы или видео до 20 МБ. Файлы хранятся в истории чата, их можно скачать повторно в любой момент.",
    "deeplink": "vseuslugi://chat"
  },
  {
    "id": "chat_block_user",
    "keywords": ["заблокировать пользователя", "нежелательные сообщения", "спам в чате", "пожаловаться на собеседника"],
    "answer": "Откройте диалог, нажмите на три точки и выберите «Заблокировать». Пользователь не сможет писать вам новые сообщения и откликаться на ваши объявления. Дополнительно можно отправить жалобу модераторам.",
    "deeplink": ""
  },
  {
    "id": "orders_create",
    "keywords": ["создать заказ", "оформить заказ", "новый заказ", "оставить заказ", "кнопка заказать"],
    "answer": "В объявлении нажмите «Заказать», заполните описание задачи, адрес, дату и бюджет. После отправки заказ появляется у исполнителя в списке и дублируется в вашем разделе «Мои заказы».",
    "deeplink": "vseuslugi://order/create"
  },
  {
    "id": "orders_track",
    "keywords": ["статус заказа", "отследить заказ", "что с заказом", "где исполнитель"],
    "answer": "Раздел «Мои заказы» показывает статусы: ожидает подтверждения, в работе, выполнен, отменен. Здесь же можно связаться с исполнителем в чате, уточнить детали или поменять срок.",
    "deeplink": "vseuslugi://order/track"
  },
  {
    "id": "orders_cancel",
    "keywords": ["отменить заказ", "отказ от заказа", "удалить заказ", "отмена заявки"],
    "answer": "Откройте заказ, нажмите «Отменить» и укажите причину. Исполнитель получит уведомление. Если заказ был оплачен, средства вернутся в кошелек автоматически.",
    "deeplink": ""
  },
  {
    "id": "orders_payment",
    "keywords": ["оплатить заказ", "оплата услуг", "способы оплаты заказа", "подтвердить оплату"],
    "answer": "При согласовании цены нажмите «Оплатить», выберите привязанную карту или кошелек и подтвердите операцию. После оплаты исполнитель видит, что бюджет заморожен, и спокойно выполняет работу. Деньги списываются только после вашего подтверждения выполнения.",
    "deeplink": ""
  },
  {
    "id": "orders_dispute",
    "keywords": ["спор по заказу", "жалоба на исполнителя", "некачественная работа", "разрешение спора"],
    "answer": "Если результат не соответствует договоренностям, откройте заказ и нажмите «Открыть спор». Опишите проблему, прикрепите фото или переписку. Модератор свяжется с обеими сторонами и предложит решение.",
    "deeplink": ""
  },
  {
    "id": "order_review",
    "keywords": ["оставить отзыв", "оценить исполнителя", "рейтинг заказа", "комментарий после заказа"],
    "answer": "После завершения заказа нажмите «Оставить отзыв». Укажите оценку от 1 до 5 и напишите короткий комментарий. Отзыв видят другие пользователи и учитывают при выборе специалиста.",
    "deeplink": ""
  },
  {
    "id": "terms_balance",
    "keywords": ["что такое баланс", "объяснение баланса", "внутренний баланс", "кошелек баланс"],
    "answer": "Баланс — это сумма денег внутри приложения. Ее можно пополнить картой, тратить на платные услуги и выводить на карту. Баланс делится на доступные средства (можно использовать сразу) и замороженные (зарезервированы под оплату активных заказов).",
    "deeplink": ""
  },
  {
    "id": "terms_wallet",
    "keywords": ["что такое кошелек", "кошелек определение", "внутренняя оплата", "аккаунт кошелек"],
    "answer": "Кошелек — раздел, где видны все операции с балансом: пополнения, списания за отклики, выплаты за завершенные работы. Здесь же настраиваются методы оплаты и вывод средств.",
    "deeplink": "vseuslugi://profile/payments"
  },
  {
    "id": "terms_category",
    "keywords": ["что такое категория", "категории объявлений", "подбор категории", "где указать категорию"],
    "answer": "Категория — это тема объявления. Она помогает пользователям найти нужный сервис. Чем точнее выбран раздел, тем больше подходящих клиентов увидит вашу карточку.",
    "deeplink": ""
  },
  {
    "id": "terms_order",
    "keywords": ["что такое заказ", "определение заказа", "заказ в приложении", "заказ услуги"],
    "answer": "Заказ — это ваша заявка на услугу или работу. В заказе фиксируются описание задачи, стоимость, сроки и статус выполнения. Все заказы хранятся в разделе «Мои заказы».",
    "deeplink": ""
  },
  {
    "id": "terms_moderation",
    "keywords": ["что такое модерация", "проверка контента", "почему отклонено", "модератор"],
    "answer": "Модерация — проверка объявлений и заказов на соответствие правилам сервиса. Мы удаляем запрещенные услуги, грубые формулировки, личные данные в тексте и фотографии, не связанные с услугой. Это защищает пользователей и повышает доверие.",
    "deeplink": ""
  },
  {
    "id": "terms_push_notifications",
    "keywords": ["что такое push", "push уведомления", "уведомления объяснение", "пуши"],
    "answer": "Push-уведомления — это короткие сообщения на экран телефона. Они сообщают о новых заказах, сообщениях, отзывах и изменениях статуса объявлений. Их можно включить или отключить в настройках профиля.",
    "deeplink": "vseuslugi://settings/notifications"
  },
  {
    "id": "city_select",
    "keywords": ["сменить город", "выбрать город", "город для объявлений", "геолокация"],
    "answer": "Нажмите на название города в шапке главного экрана и выберите нужный из списка. Приложение сразу покажет объявления и заказы только в выбранном городе. Настройку можно менять сколько угодно раз.",
    "deeplink": "vseuslugi://city/select"
  },
  {
    "id": "home_categories_overview",
    "keywords": ["главный экран", "карточки услуг", "категории на главной", "чем заняться"],
    "answer": "На главной странице расположены быстрые карточки: Услуги, Работа, Прокат, Такси, Карта и Чаты. Каждая карточка ведет в соответствующий раздел, чтобы вы быстрее нашли нужный сценарий.",
    "deeplink": "vseuslugi://home/services"
  },
  {
    "id": "favorites_overview",
    "keywords": ["избранное", "сохраненные услуги", "понравившиеся", "список избранного"],
    "answer": "В «Профиль» → «Избранное» собраны объявления и специалисты, которые вы отметили сердечком. Здесь легко сравнивать предложения, возвращаться к перепискам и быстро оформлять повторные заказы.",
    "deeplink": "vseuslugi://profile/favorites"
  },
  {
    "id": "profile_my_orders",
    "keywords": ["мои заказы", "история заказов", "заказы пользователя", "выполненные и текущие"],
    "answer": "Раздел «Мои заказы» делит заявки на вкладки: активные, завершенные, отмененные. Откройте заказ, чтобы увидеть детали, переписку, документы и кнопки оплаты или отмены.",
    "deeplink": "vseuslugi://profile/orders"
  },
  {
    "id": "profile_my_ads",
    "keywords": ["мои объявления", "управление объявлениями", "активные объявления", "черновики"],
    "answer": "Все созданные объявления находятся в «Профиль» → «Мои объявления». Здесь видно статус (опубликовано, на модерации, снято), статистику просмотров и кнопки редактирования, продвижения или удаления.",
    "deeplink": "vseuslugi://profile/ads"
  },
  {
    "id": "profile_subscriptions",
    "keywords": ["подписки", "тарифы", "премиум функции", "платные опции"],
    "answer": "В этом разделе представлены тарифы для активных исполнителей: дополнительные отклики, продвижение, аналитика, персональный менеджер. Выберите тариф, оплатите из кошелька и активируйте его на нужный срок.",
    "deeplink": "vseuslugi://profile/subscriptions"
  },
  {
    "id": "support_contact",
    "keywords": ["написать в поддержку", "служба поддержки", "чат с оператором", "жалоба в поддержку"],
    "answer": "В «Помощи» есть кнопка «Написать оператору». Опишите проблему, приложите файлы и отправьте. Мы отвечаем в среднем за 10–15 минут в рабочее время и обязательно возвращаемся ко всем запросам.",
    "deeplink": "vseuslugi://profile/help"
  },
  {
    "id": "complaint_user",
    "keywords": ["пожаловаться на пользователя", "жалоба на исполнителя", "некорректное общение", "оскорбления"],
    "answer": "Если столкнулись с нарушением правил, откройте профиль пользователя или чат, нажмите на три точки и выберите «Пожаловаться». Опишите ситуацию, приложите скриншоты. Мы проверим переписку и примем меры вплоть до блокировки.",
    "deeplink": ""
  },
  {
    "id": "notifications_troubleshooting",
    "keywords": ["пуши не приходят", "нет уведомлений", "уведомления отключены", "решение проблем push"],
    "answer": "Проверьте: 1) уведомления включены в «Профиль» → «Настройки»; 2) разрешения приложения не ограничены в системных настройках телефона; 3) вы не находитесь в режиме «Не беспокоить». После изменений перезапустите приложение.",
    "deeplink": "vseuslugi://settings/notifications"
  },
  {
    "id": "login_required",
    "keywords": ["нужна авторизация", "требуется вход", "доступ только после входа", "ошибка авторизации"],
    "answer": "Некоторые действия (создание объявлений, просмотр чатов, отклики) доступны только авторизованным пользователям. Если видите запрос на вход, нажмите «Войти» или «Зарегистрироваться» и продолжите работу уже из профиля.",
    "deeplink": "vseuslugi://auth/login"
  },
  {
    "id": "taxi_passenger_order",
    "keywords": ["заказать такси", "пассажир", "вызов машины", "поездка по городу", "booking taxi"],
    "answer": "Откройте карточку «Такси», укажите адрес отправления и назначения, выберите тариф и подтвердите заказ. На карте видно местоположение водителя и время подачи. Об изменениях статуса уведомим пушем.",
    "deeplink": "vseuslugi://taxi/order"
  },
  {
    "id": "taxi_passenger_intercity",
    "keywords": ["межгород", "поездка в другой город", "дальняя поездка", "межгороднее такси"],
    "answer": "Во вкладке «Такси» выберите режим «Межгород». Заполните города, дату, время и количество мест. Заказ отправится водителям, которые выполняют дальние маршруты. Они откликнутся прямо в приложении.",
    "deeplink": "vseuslugi://taxi/intercity/passenger"
  },
  {
    "id": "taxi_passenger_history",
    "keywords": ["история поездок", "мои поездки", "архив такси", "прошлые поездки"],
    "answer": "В меню такси откройте «История поездок». Здесь сохранены маршруты, суммы и имена водителей. При необходимости можно повторить заказ по тем же адресам.",
    "deeplink": "vseuslugi://taxi/history/passenger"
  },
  {
    "id": "taxi_driver_become",
    "keywords": ["стать водителем", "регистрация водителя", "документы водителя", "работа в такси"],
    "answer": "Нажмите «Стать водителем», заполните анкету с паспортными данными, номером телефона, фото авто, техпаспортом и страховкой. После проверки профиля получите доступ к заказам и сможете выходить на линию.",
    "deeplink": "vseuslugi://taxi/become-driver"
  },
  {
    "id": "taxi_driver_orders",
    "keywords": ["принимать заказы", "водитель онлайн", "ленту заказов", "доступные поездки"],
    "answer": "Во вкладке «Город» отображаются активные заявки. Чтобы начать работу, включите режим «На линии». При поступлении заказа увидите маршрут, стоимость и расстояние до клиента. Нажмите «Принять», чтобы закрепить поездку за собой.",
    "deeplink": "vseuslugi://taxi/driver"
  },
  {
    "id": "taxi_driver_history",
    "keywords": ["история заказов водителя", "завершенные поездки", "статистика водителя"],
    "answer": "В меню выберите «История заказов». Раздел показывает выполненные маршруты, доход и рейтинги. Здесь удобно проверять, все ли поездки учтены, и планировать вывод средств.",
    "deeplink": "vseuslugi://taxi/history/driver"
  },
  {
    "id": "taxi_driver_profile",
    "keywords": ["профиль водителя", "данные автомобиля", "настройки водителя", "рейтинг водителя"],
    "answer": "Водительский профиль показывает рейтинг, отзывы, пробег, марку авто и номерной знак. Здесь же можно обновить фотографии автомобиля и контактный номер для пассажиров.",
    "deeplink": "vseuslugi://taxi/driver/profile"
  },
  {
    "id": "taxi_courier_become",
    "keywords": ["стать курьером", "регистрация курьера", "доставка документов", "работа курьера"],
    "answer": "В разделе «Такси» нажмите «Стать курьером», заполните анкету с ИИН, адресом, контактами и загрузите фото удостоверения. После подтверждения сможете принимать заказы на доставку в городе.",
    "deeplink": "vseuslugi://taxi/become-courier"
  },
  {
    "id": "taxi_courier_orders",
    "keywords": ["заказы курьера", "доставка", "курьер онлайн", "лента доставок"],
    "answer": "В меню курьера откройте «Главная» и включите «На линии». На экране появятся заявки с адресами отправителя и получателя, весом посылки и оплатой. Нажмите «Принять», чтобы закрепить доставку.",
    "deeplink": "vseuslugi://taxi/courier"
  },
  {
    "id": "taxi_sender_order",
    "keywords": ["заказать доставку", "отправить посылку", "курьерская доставка", "груз"],
    "answer": "Выберите «Доставка», укажите адреса, описание груза, вес и желаемое время. После публикации заявку увидят курьеры и смогут откликнуться. В истории доставок отслеживайте статус и оплату.",
    "deeplink": "vseuslugi://taxi/sender/order"
  },
  {
    "id": "taxi_sender_history",
    "keywords": ["история доставок", "мои доставки", "отправленные посылки", "архив доставок"],
    "answer": "В меню доставки нажмите «История доставок». Там собраны выполненные и активные отправления, статусы курьера, стоимость и контакт получателя.",
    "deeplink": "vseuslugi://taxi/history/sender"
  },
  {
    "id": "role_switch",
    "keywords": ["сменить роль", "стать водителем", "перейти в режим курьера", "роля пассажир"],
    "answer": "В разделе «Такси» откройте боковое меню и выберите нужную роль: пассажир, водитель или курьер. Интерфейс и кнопки изменятся под выбранный сценарий, а уведомления будут приходить только по активной роли.",
    "deeplink": "vseuslugi://taxi/role/switch"
  }
]
